# Advanced Dataframes

## Examples problems from curriculum

In [2]:
import pandas as pd
import numpy as np
from pydataset import data

Format for connection string: protocol://[user[:password]@]hostname/[database_name]

Example of what one might look like: mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db

In [7]:
# import necessary info from env.py file

from env import host, user, password

In [8]:
# create url

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [9]:
# read in some data using this url

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27